"use strict";

/*
Необязательное задание.
Если вам показалось домашнее задание простым, выполняем данный пункт.

Необходимо от пользователя получить целое число.
Необходимо вывести разряды числа, а именно: количество сотен, десятков и единиц.

Пример:
Пользователь ввел число 163. Программа должна вывести:
"В числе 163 количество сотен: 1, десятков: 6, единиц: 3"

Пример 2:
Пользователь ввел число 74. Программа должна вывести:
"В числе 74 количество сотен: 0, десятков: 7, единиц: 4"

Пример 3:
Пользователь ввел число 9537. Программа должна вывести:
"В числе 9537 количество сотен: 5, десятков: 3, единиц: 7"

Уточнение: Пользователь всегда вводит корректное положительное целое число.
Подсказка: Возможно, вам понадобится округление чисел и оператор %.
*/

let number = String(prompt("Введите целое положительное число: "));
if (number % 1 != 0 || number < 0) {
  alert("Введите целое положительное число число!");
} else {
  let len_number_arr = number.split("");
  while (len_number_arr.length < 3) {
    len_number_arr.unshift("0");
  }
  console.log(
    `В числе ${number} количество сотен: ${len_number_arr.at(
      -3
    )}, десятков: ${len_number_arr.at(-2)}, единиц:  ${len_number_arr.at(-1)}`
  );
}
